Merge branch 'main' of https://github.com/aiappsgbb/AOAI-models-migration
